//Написати ф-ю <strong>median</strong> яка приймає масив і знаходить
//його медіану Медіана – це числове значення, яке ділить
//відсортований масив чисел на більшу і меншу половини. У
//відсортованому масиві з непарним числом елементів медіана – це
//число в середині масиву. Для масиву з парним числом елементів, де
//нема ні одного елемента точно посередині, медіана – це середнє
//значення двох чисел, які знаходяться в середині масиву. В цій
//задачі заданий непустий масив натуральних чисел. Вам потрібно
//знайти медіану даного масиву.


let median = (arr) => {
  arr.sort((a, b) => a - b)
  let lowMiddle = Math.floor( (arr.length - 1) / 2);
  let highMiddle = Math.ceil( (arr.length - 1) / 2);
  return (arr[lowMiddle] + arr[highMiddle]) / 2;
}

console.log(median([1, 2, 3, 4, 5])) // 3
console.log(median([3, 6, 10, 15, 20, 99])) // 12.5
console.log(median([2, 56, 3, 41, 55, 88, 48, 155, 0, 4, 100, 23])) // 44.5